In [ ]:
import pandas as pd
# 2차원 데이터 생성
# dic 타입으로 구성해서 2차원 데이터로 변환
data = {
  '이름': ['강나래','강태원','강호림','김수찬','김재욱','박동현','박혜정','송근열'],
  '학교': ['구로고','구로고','가산고','구로고','가산고','가산고','구로고','구로고'],
  '키': [197,184,168,187,188,202,188,190],
  '국어': [90,40,80,40,15,80,55,100],
  '영어': [85,35,75,60,20,100,65,85],
  '수학': [100,50,70,70,10,95,45,90],
  '사회': [85,25,75,80,10,80,35,95],
  'SW특기': ['Python','Java','Javascript',' ',' ','c','PYTHON','C#']
}

In [4]:
data
type(data)

dict

In [6]:
# dict 타입 : 키를 활용해서 데이터를 출력
data['키']
data['SW특기']

['Python', 'Java', 'Javascript', ' ', ' ', 'c', 'PYTHON', 'C#']

In [9]:
### dict 타입을 pandas > DataFrame
# t = pd.Series(temp) (1차원)
df = pd.DataFrame(data) # (2차원) 딕셔너리 타입을 입력하면 DataFrame타입으로 변경
df

0    197
1    184
2    168
3    187
4    188
5    202
6    188
7    190
Name: 키, dtype: int64

In [10]:
df['키']

0    197
1    184
2    168
3    187
4    188
5    202
6    188
7    190
Name: 키, dtype: int64

In [13]:
# 순서도 바꿀 수 있고 여러개를 출력하려면 대괄호 2개 써야함 [[ ]]
df[['이름','키','국어']]
df[['이름','키']]

    이름    키   국어
0  강나래  197   90
1  강태원  184   40
2  강호림  168   80
3  김수찬  187   40
4  김재욱  188   15
5  박동현  202   80
6  박혜정  188   55
7  송근열  190  100

In [14]:
# 컬럼이름을 모두 확인
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '사회', 'SW특기'], dtype='object')

In [15]:
# 데이터에서 특정컬럼만 뽑아서 가져올 수 있음
# 순서도 변경 가능
df = pd.DataFrame(data, columns=['이름','학교','SW특기'])
df

    이름   학교        SW특기
0  강나래  구로고      Python
1  강태원  구로고        Java
2  강호림  가산고  Javascript
3  김수찬  구로고
4  김재욱  가산고
5  박동현  가산고           c
6  박혜정  구로고      PYTHON
7  송근열  구로고          C#